tell_it_backend_api/app/controllers/messages_controller.rb

INSERT INTO "messages" ("title", "body", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Greeting"], ["body", "Hello World!"], ["created_at", "2020-04-03 21:27:36.553377"], ["updated_at", "2020-04-03 21:27:36.553377"], ["user_id", 1]]
---
  def create
    @message = Message.new(message_params)
    @message.user_id = params[:user_id]
    if @message.save

DELETE FROM "messages" WHERE "messages"."id" = $1  [["id", 1]]
---
  def destroy
    @message.destroy